Revit 2025 API
ParameterTypeId.ViewDesignOptionsConfig Property
 "Design Option Configuration"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static ForgeTypeId ViewDesignOptionsConfig { get; }
Public Shared ReadOnly Property ViewDesignOptionsConfig As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewDesignOptionsConfig {
	ForgeTypeId^ get ();
}
static member ViewDesignOptionsConfig : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace